#!/bin/bash

# 1. Перевіряємо, чи передано файл
if [ -z "$1" ]; then
    echo "Помилка: вкажіть файл для запуску (наприклад: ./run.sh or.txt)"
    exit 1
fi


# 3. Транспілюємо код Origin++ у C++
echo "==> Транспіляція $1..."
./main "$1"
if [ $? -ne 0 ]; then
    echo "Помилка: Не вдалося транспілювати файл $1"
    exit 1
fi

# 4. Компілюємо згенерований C++ код у бінарник
echo "==> Компіляція згенерованого C++ коду..."
clang++ -std=c++17 origin.cpp -o origin_bin
if [ $? -ne 0 ]; then
    echo "Помилка: Не вдалося скомпілювати origin.cpp"
    exit 1
fi

# 5. Запускаємо готову програму
echo "==> Запуск програми..."
echo "----------------------------------------"
./origin_bin
echo "----------------------------------------"
